tap "databricks/tap"
tap "homebrew/services"
tap "ngrok/ngrok"
tap "powershell/tap"
tap "stripe/stripe-cli"
brew "xz"
brew "ast-grep"
brew "atuin"
brew "azure-cli"
brew "bat"
brew "btop"
brew "ghc"
brew "cabal-install"
brew "carapace"
brew "cmake"
brew "deno"
brew "docker-compose"
brew "eza"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "ghcup"
brew "git-delta"
brew "glow"
brew "go"
brew "golang-migrate"
brew "hadolint"
brew "haskell-language-server"
brew "haskell-stack"
brew "helix"
brew "helm"
brew "idris2"
brew "jq"
brew "kompose"
brew "kubernetes-cli"
brew "libomp"
brew "python@3.13"
brew "llvm"
brew "nasm"
brew "neofetch"
brew "neovim"
brew "node"
brew "nushell"
brew "ollama"
brew "openblas"
brew "openjdk@17"
brew "openjdk@21"
brew "pandoc"
brew "pipx"
brew "pkgconf"
brew "poppler"
brew "postgresql@14"
brew "postgresql@16"
brew "postgresql@17"
brew "pyenv"
brew "qemu"
brew "redis"
brew "ripgrep"
brew "ruff"
brew "sfml"
brew "tectonic"
brew "telnet"
brew "terminal-notifier"
brew "testdisk"
brew "tfenv"
brew "tmux"
brew "tree"
brew "unar"
brew "wrk"
brew "yt-dlp"
brew "zig"
brew "zoxide"
brew "databricks/tap/databricks"
brew "powershell/tap/powershell"
brew "stripe/stripe-cli/stripe"
cask "arm-performance-libraries"
cask "basictex"
cask "dbeaver-community"
cask "docker-desktop"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono"
cask "font-meslo-lg-nerd-font"
cask "gcloud-cli"
cask "iterm2"
cask "ngrok"
cask "tableplus"
cask "temurin"
cask "visual-studio-code"
cask "warp"
cask "zed"
vscode "anthropic.claude-code"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "scala-lang.scala"
vscode "scalameta.metals"
vscode "vscodevim.vim"
go "github.com/golangci/golangci-lint/cmd/golangci-lint"
go "golang.org/x/tools/gopls"
go "honnef.co/go/tools/cmd/staticcheck"
brew "lazygit"
brew "yazi"
brew "tldr"
